In [1]:
import pandas as pd
import json

In [5]:
datos_dicc = [{'ID':1,'Nombre':'Hector', 'edad':20, 'mencion_gaseosa':['Coca-Cola','Colombiana','Pepsi'], 
                  'hobbies':['Musica', 'Correr']},
                {'ID':2,'Nombre':'Carolina', 'edad':40, 'mencion_gaseosa':['Coca-Cola','Manzana Postobón','Sprite'], 
                  'hobbies':'Cine'},
                {'ID':3, 'edad':27, 'mencion_gaseosa':['Coca-Cola','Colombiana','Pepsi'], 
                  'hobbies':['Escribir', 'Viajar']},
                {'ID':4,'Nombre':'Camila', 'edad':18, 'mencion_gaseosa':['Pepsi','Coca-Cola']},
                {'ID':5,'Nombre':'Jose', 'edad':50, 'mencion_gaseosa':['Coca-Cola'], 
                  'hobbies':'Programar'}]

In [20]:
datos=pd.json_normalize(datos_dicc)
datos

,ID,Nombre,edad,mencion_gaseosa,hobbies
0,1,Hector,20,"[Coca-Cola, Colombiana, Pepsi]","[Musica, Correr]"
1,2,Carolina,40,"[Coca-Cola, Manzana Postobón, Sprite]",Cine
2,3,NaN,27,"[Coca-Cola, Colombiana, Pepsi]","[Escribir, Viajar]"
3,4,Camila,18,"[Pepsi, Coca-Cola]",NaN
4,5,Jose,50,[Coca-Cola],Programar

In [15]:
datos.mencion_gaseosa.values.tolist()

[['Coca-Cola', 'Colombiana', 'Pepsi'],
 ['Coca-Cola', 'Manzana Postobón', 'Sprite'],
 ['Coca-Cola', 'Colombiana', 'Pepsi'],
 ['Pepsi', 'Coca-Cola'],
 ['Coca-Cola']]

In [16]:
pd.DataFrame(datos.mencion_gaseosa.values.tolist())

           0                 1       2
0  Coca-Cola        Colombiana   Pepsi
1  Coca-Cola  Manzana Postobón  Sprite
2  Coca-Cola        Colombiana   Pepsi
3      Pepsi         Coca-Cola    None
4  Coca-Cola              None    None

In [21]:
datos=datos.join(pd.DataFrame(datos.mencion_gaseosa.values.tolist()))

In [26]:
datos.rename(columns={0:'Marca1', 1:'Marca2',2:'Marca3'}, inplace=True)
datos

,ID,Nombre,edad,mencion_gaseosa,hobbies,Marca1,Marca2,Marca3
0,1,Hector,20,"[Coca-Cola, Colombiana, Pepsi]","[Musica, Correr]",Coca-Cola,Colombiana,Pepsi
1,2,Carolina,40,"[Coca-Cola, Manzana Postobón, Sprite]",Cine,Coca-Cola,Manzana Postobón,Sprite
2,3,NaN,27,"[Coca-Cola, Colombiana, Pepsi]","[Escribir, Viajar]",Coca-Cola,Colombiana,Pepsi
3,4,Camila,18,"[Pepsi, Coca-Cola]",NaN,Pepsi,Coca-Cola,None
4,5,Jose,50,[Coca-Cola],Programar,Coca-Cola,None,None